UltimateHackingKeyboard/bootloader/apps/KinetisFlashTool/KinetisFlashTool/Bootloader.cpp
/*
* Copyright (c) 2013-15, Freescale Semiconductor, Inc.
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without modification,
* are permitted provided that the following conditions are met:
*
* o Redistributions of source code must retain the above copyright notice, this list
*   of conditions and the following disclaimer.
*
* o Redistributions in binary form must reproduce the above copyright notice, this
*   list of conditions and the following disclaimer in the documentation and/or
*   other materials provided with the distribution.
*
* o Neither the name of Freescale Semiconductor, Inc. nor the names of its
*   contributors may be used to endorse or promote products derived from this
*   software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
* ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
* DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
* ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
* (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
* LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
* ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
* (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
* SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*/

#include "stdafx.h"
#include "KinetisFlashTool.h"
#include "KinetisFlashToolDlg.h"
#include "Bootloader.h"

extern CKinetisFlashToolDlg *g_pMainDlg;
extern void PrintLog(const wchar_t *format, ...);

UINT ThreadFunc(LPVOID pParam);

// See Bootloader.h for documentation of this method.
Bootloader *g_pBootloader;

// See Bootloader.h for documentation of this method.
DWORD Bootloader::Open()
{
    m_pingEvent = CreateEvent(NULL, TRUE, FALSE, NULL);
    if (m_pingEvent == NULL)
        return GetLastError();

    m_statusEvent = CreateEvent(NULL, TRUE, FALSE, NULL);
    if (m_statusEvent == NULL)
        return GetLastError();

    m_resetEvent = CreateEvent(NULL, TRUE, FALSE, NULL);
    if (m_resetEvent == NULL)
        return GetLastError();

    m_connectEvent = CreateEvent(NULL, TRUE, FALSE, NULL);
    if (m_connectEvent == NULL)
        return GetLastError();

    m_updateEvent = CreateEvent(NULL, TRUE, FALSE, NULL);
    if (m_updateEvent == NULL)
        return GetLastError();

    m_eraseEvent = CreateEvent(NULL, TRUE, FALSE, NULL);
    if (m_eraseEvent == NULL)
        return false;

    m_programOnceEvent = CreateEvent(NULL, TRUE, FALSE, NULL);
    if (m_programOnceEvent == NULL)
        return false;

    // Auto reset for exit event
    m_exitEvent = CreateEvent(NULL, FALSE, FALSE, NULL);
    if (m_exitEvent == NULL)
        return false;

    m_isRunning = false;
    m_isExiting = false;

    m_updater = NULL;
    m_isConneted = false;
    m_config.ping = true;
    m_config.packetTimeoutMs = 5000;

    m_pThread = AfxBeginThread(ThreadFunc, this, THREAD_PRIORITY_NORMAL, 0);

    return true;
}

// See Bootloader.h for documentation of this method.
void Bootloader::Close()
{
    if (m_isConneted)
    {
        while (!CanRun())
            ;
        SetEvent(m_resetEvent);
    }

    SetEvent(m_exitEvent);
    WaitForSingleObject(m_pThread->m_hThread, INFINITE);

    if (m_updater != NULL)
    {
        delete m_updater;
        m_updater = NULL;
    }

    CloseHandle(m_exitEvent);
    m_exitEvent = NULL;
    CloseHandle(m_programOnceEvent);
    m_programOnceEvent = NULL;
    CloseHandle(m_eraseEvent);
    m_eraseEvent = NULL;
    CloseHandle(m_pingEvent);
    m_pingEvent = NULL;
    CloseHandle(m_statusEvent);
    m_statusEvent = NULL;
    CloseHandle(m_resetEvent);
    m_resetEvent = NULL;
    CloseHandle(m_connectEvent);
    m_connectEvent = NULL;
    CloseHandle(m_updateEvent);
    m_updateEvent = NULL;
}

// See Bootloader.h for documentation of this method.
void Bootloader::progressCallback(int percentage, int segmentIndex, int segmentCount)
{
    // param segmentIndex starts from 1.
    // param percentage shows the percentage for current segment.
    // So need to calculate the finnal percentage of the progress here.
    int finalPercentage = (segmentIndex - 1) * 100 / segmentCount + percentage / segmentCount;
    ::SendMessage(g_pMainDlg->m_updateDlg, USER_MS_UPDATA_PROGRESS, (WPARAM)finalPercentage, NULL);
}

// See Bootloader.h for documentation of this method.
bool Bootloader::CanRun()
{
    if (m_pThread && !m_isRunning)
        return true;
    else
        return false;
}

// See Bootloader.h for documentation of this method.
void Bootloader::Ping()
{
    DWORD state = WaitForEvents(0);
#ifdef _DEBUG
    PrintLog(_T("Events state = %d at Ping()"), state);
#endif
    // Set this event only when no event is triggered.
    if (state == WAIT_TIMEOUT)
    {
        SetEvent(m_pingEvent);
    }
}

// See Bootloader.h for documentation of this method.
void Bootloader::UpdateStatus()
{
    if (!m_isConneted)
    {
        return;
    }
    // This event must always be triggered when connection is setup.
    // So no matter whether there is other event triggered, still trigger this
    // event.
    SetEvent(m_statusEvent);
}

// See Bootloader.h for documentation of this method.
void Bootloader::Reset()
{
    if (!m_isConneted)
    {
        return;
    }

    DWORD state = WaitForEvents(0);
#ifdef _DEBUG
    PrintLog(_T("Events state = %d at Reset()"), state);
#endif
    // if no event is triggered, or only ping event is triggered, set this event.
    if ((state == WAIT_OBJECT_0) || (state == WAIT_TIMEOUT))
    {
        SetEvent(m_resetEvent);
    }
}

// See Bootloader.h for documentation of this method.
void Bootloader::Connect(blfwkdll::Updater::PeripheralConfig *config)
{
    DWORD state = WaitForEvents(0);
#ifdef _DEBUG
    PrintLog(_T("Events state = %d at Connect()"), state);
#endif
    // if no event is triggered, or only ping event is triggered, set this event.
    if ((state == WAIT_OBJECT_0) || (state == WAIT_TIMEOUT))
    {
        m_config = *config;
        SetEvent(m_connectEvent);
    }
}

// See Bootloader.h for documentation of this method.
void Bootloader::UpdateImage(blfwkdll::Updater::PeripheralConfig *config, FlashFirmwareOption *option)
{
#ifdef DISABLE_QUICK_UPDATE
    if (!m_isConneted)
    {
        return;
    }
#endif
    DWORD state = WaitForEvents(0);
#ifdef _DEBUG
    PrintLog(_T("Events state = %d at UpdateImage()"), state);
#endif
    // if no event is triggered, or only ping event is triggered, set this event.
    if ((state == WAIT_OBJECT_0) || (state == WAIT_TIMEOUT))
    {
        if (config != NULL)
        {
            m_config = *config;
        }
        m_firmwareConfig = *option;
        m_abort = false;
        SetEvent(m_updateEvent);
    }
}

// See Bootloader.h for documentation of this method.
void Bootloader::Erase(EraseOption *option)
{
    if (!m_isConneted)
    {
        return;
    }

    DWORD state = WaitForEvents(0);
#ifdef _DEBUG
    PrintLog(_T("Events state = %d at Erase()"), state);
#endif
    // if no event is triggered, or only ping event is triggered, set this event.
    if ((state == WAIT_OBJECT_0) || (state == WAIT_TIMEOUT))
    {
        m_eraseOption = *option;
        SetEvent(m_eraseEvent);
    }
}

// See Bootloader.h for documentation of this method.
void Bootloader::ProgramOnce(ProgramOnceOption *option)
{
    if (!m_isConneted)
    {
        return;
    }

    DWORD state = WaitForEvents(0);
#ifdef _DEBUG
    PrintLog(_T("Events state = %d at ProgramOnce()"), state);
#endif
    // if no event is triggered, or only ping event is triggered, set this event.
    if ((state == WAIT_OBJECT_0) || (state == WAIT_TIMEOUT))
    {
        m_programOnceOption = *option;
        SetEvent(m_programOnceEvent);
    }
}

// See Bootloader.h for documentation of this method.
DWORD Bootloader::WaitForEvents(DWORD timeout)
{
    DWORD result;
    HANDLE eventsToWait[8] = {
        m_pingEvent,   m_statusEvent, m_resetEvent,       m_connectEvent,
        m_updateEvent, m_eraseEvent,  m_programOnceEvent, m_exitEvent,
    };

