UltimateHackingKeyboard/bootloader/apps/KinetisFlashTool/KinetisFlashTool/Bootloader.cpp
    result = WaitForMultipleObjects(8, eventsToWait, FALSE, timeout);

    switch (result)
    {
        case WAIT_OBJECT_0:
        case WAIT_OBJECT_0 + 1:
        case WAIT_OBJECT_0 + 2:
        case WAIT_OBJECT_0 + 3:
        case WAIT_OBJECT_0 + 4:
        case WAIT_OBJECT_0 + 5:
        case WAIT_OBJECT_0 + 6:
            m_isRunning = true;
            break;
        case WAIT_OBJECT_0 + 7:
            m_isExiting = true;
            break;
        default:
            break;
    }
    return result;
}

// See Bootloader.h for documentation of this method.
void Bootloader::ResetEvents(DWORD events)
{
    switch (events)
    {
        case WAIT_OBJECT_0:
            ResetEvent(m_pingEvent);
            break;
        case WAIT_OBJECT_0 + 1:
            ResetEvent(m_statusEvent);
            break;
        case WAIT_OBJECT_0 + 2:
            ResetEvent(m_resetEvent);
            break;
        case WAIT_OBJECT_0 + 3:
            ResetEvent(m_connectEvent);
            break;
        case WAIT_OBJECT_0 + 4:
            ResetEvent(m_updateEvent);
            break;
        case WAIT_OBJECT_0 + 5:
            ResetEvent(m_eraseEvent);
            break;
        case WAIT_OBJECT_0 + 6:
            ResetEvent(m_programOnceEvent);
            break;
        case WAIT_OBJECT_0 + 7:
            // Auto Reset is enabled for this event.
            break;
        default:
            break;
    }
}

//! \brief Chile thread function.
UINT ThreadFunc(LPVOID pParam)
{
    uint32_t responseWords[6];
    uint32_t status;
    Bootloader *pBootloader = (Bootloader *)pParam;

    while (!pBootloader->m_isExiting)
    {
        DWORD result = pBootloader->WaitForEvents(INFINITE);
        switch (result)
        {
            case WAIT_OBJECT_0: // Ping Operation
                try
                {
                    if (pBootloader->m_updater == NULL)
                    {
                        pBootloader->m_updater = new blfwkdll::Updater(&pBootloader->m_config);
                    }
                    else
                    {
                        if (pBootloader->m_config.peripheralType ==
                            blfwkdll::Updater::HOST_PERIPHERAL_TYPE_TAG::kHostPeripheralType_USB_HID)
                        {
                            // No ping packet for USB. So use getProperty 1 to test to
                            // communication.
                            pBootloader->m_updater->getProperty(
                                blfwkdll::Updater::PROPERTY_TAG::kPropertyTag_BootloaderVersion, responseWords);
                        }
                        else
                        {
                            // Send ping packet for serial peripherals.
                            pBootloader->m_updater->ping(0, 0, 0);
                        }
                    }
                    if (!pBootloader->m_isConneted)
                    {
                        // Status is changed from disconnected to connected, send out the
                        // message.
                        pBootloader->m_isConneted = true;
                        ::PostMessage(*g_pMainDlg, USER_MS_CONNECTION_CHANGE, NULL, NULL);
                    }
                }
#ifdef _DEBUG
                catch (const std::exception &e)
#else
                catch (const std::exception &)
#endif
                {
#ifdef _DEBUG
                    // Print ping failed info when active config is debug.
                    PrintLog(_T("Error: Ping device failed(%s)."), CString(e.what()));
#endif
                    // If connection is failed via USB, we need to delete update and then
                    // re-enumerate it at the second attempt.
                    if ((pBootloader->m_config.peripheralType ==
                         blfwkdll::Updater::HOST_PERIPHERAL_TYPE_TAG::kHostPeripheralType_USB_HID) &&
                        (pBootloader->m_updater != NULL))
                    {
                        delete pBootloader->m_updater;
                        pBootloader->m_updater = NULL;
                    }
                    // Status is changed from connected to disconnected, send out the
                    // message.
                    if (pBootloader->m_isConneted)
                    {
                        pBootloader->m_isConneted = false;
                        ::PostMessage(*g_pMainDlg, USER_MS_CONNECTION_CHANGE, NULL, NULL);
                    }
                }
                break;

            case WAIT_OBJECT_0 + 1: // Update status
                if (pBootloader->m_updater == NULL)
                {
#ifdef _DEBUG
                    PrintLog(_T("Error: Invalid Bootloader.m_updater(NULL).\r\n"));
#else
                    PrintLog(_T("Error: Fail to communicate with device. Please reconnet the device.\r\n"));
#endif
                    break;
                }

                try
                {
                    pBootloader->m_updater->getProperty(blfwkdll::Updater::PROPERTY_TAG::kPropertyTag_BootloaderVersion,
                                                        responseWords);
                    pBootloader->m_targetInfo.targetVersion = responseWords[1];

                    pBootloader->m_targetInfo.procotolVersion = pBootloader->m_updater->getSerialProtocolVersion();

                    pBootloader->m_updater->getProperty(
                        blfwkdll::Updater::PROPERTY_TAG::kPropertyTag_FlashSecurityState, responseWords);
                    pBootloader->m_targetInfo.securityState = responseWords[1];

                    pBootloader->m_targetInfo.flashSize = pBootloader->m_updater->getFlshSize();

                    pBootloader->m_targetInfo.flashSectorSize = pBootloader->m_updater->getSectorSize();

                    pBootloader->m_updater->getProperty(blfwkdll::Updater::PROPERTY_TAG::kPropertyTag_RAMSizeInBytes,
                                                        responseWords);
                    pBootloader->m_targetInfo.ramSize = responseWords[1];

                    pBootloader->m_updater->getProperty(blfwkdll::Updater::PROPERTY_TAG::kPropertyTag_ReservedRegions,
                                                        responseWords);
                    pBootloader->m_targetInfo.rsvRgnFlashStart = responseWords[1];
                    pBootloader->m_targetInfo.rsvRgnFlashEnd = responseWords[2];
                    pBootloader->m_targetInfo.rsvRgnRamStart = responseWords[3];
                    pBootloader->m_targetInfo.rsvRgnRamEnd = responseWords[4];

                    pBootloader->m_updater->getProperty(blfwkdll::Updater::PROPERTY_TAG::kPropertyTag_AvailableCommands,
                                                        responseWords);
                    pBootloader->m_targetInfo.supportedCmd = responseWords[1];

                    ::PostMessage(*g_pMainDlg, USER_MS_UPDATA_STATUS, NULL, NULL);
                }
                catch (const std::exception &e)
                {
                    PrintLog(_T("Error: Update status failed(%s).\r\n"), CString(e.what()));
                }
                break;

            case WAIT_OBJECT_0 + 2: // Reset
                if (pBootloader->m_updater == NULL)
                {
#ifdef _DEBUG
                    PrintLog(_T("Error: Invalid Bootloader.m_updater(NULL).\r\n"));
#else
                    PrintLog(_T("Error: Fail to communicate with device. Please reconnet the device.\r\n"));
#endif
                    break;
                }
                try
                {
                    pBootloader->m_updater->reset();
                    PrintLog(_T("Reset device successfully!"));
                }
                catch (const std::exception &e)
                {
                    PrintLog(_T("Error: Reset device failed(%s).\r\n"), e.what());
                }
                delete pBootloader->m_updater;
                pBootloader->m_updater = NULL;

                // Status is changed from connected to disconnected, send out the message.
                if (pBootloader->m_isConneted)
                {
                    pBootloader->m_isConneted = false;
                    ::PostMessage(*g_pMainDlg, USER_MS_CONNECTION_CHANGE, NULL, NULL);
                }
                break;

            case WAIT_OBJECT_0 + 3: // Connect
                try
                {
                    // Peripheral configs might be changed, So must re-declare a new one.
                    if (pBootloader->m_updater != NULL)
                        delete pBootloader->m_updater;

