UltimateHackingKeyboard/bootloader/apps/KinetisFlashTool/KinetisFlashTool/Bootloader.cpp
                    pBootloader->m_updater = new blfwkdll::Updater(&pBootloader->m_config);

                    // Status is changed from disconnected to connected, send out the
                    // message.
                    if (!pBootloader->m_isConneted)
                    {
                        pBootloader->m_isConneted = true;
                        ::PostMessage(*g_pMainDlg, USER_MS_CONNECTION_CHANGE, NULL, NULL);
                    }
                }
                catch (const std::exception &e)
                {
                    PrintLog(_T("Error: Connect device failed(%s).\r\n"), CString(e.what()));

                    if (pBootloader->m_isConneted)
                    {
                        pBootloader->m_isConneted = false;
                        ::PostMessage(*g_pMainDlg, USER_MS_CONNECTION_CHANGE, NULL, NULL);
                    }
                }
                break;

            case WAIT_OBJECT_0 + 4: // Update Image
                PrintLog(_T("Start update progress......"));
                pBootloader->progressCallback(0, 1, 1); // Reset the progress bar
#ifndef DISABLE_QUICK_UPDATE
                // If not connect to a device, try to connect firstly.
                if ((!pBootloader->m_isConneted) || (pBootloader->m_updater == NULL))
                {
                    bool cntStatus = false;
                    PrintLog(_T("No device is connected!\r\nTry to connect device......"));
                    // Try 5 attempts to connect device.
                    for (size_t retry = 0; retry < 5; retry++)
                    {
                        try
                        {
                            // If it is not NULL, delete it,  for the reason that peripheral
                            // configuration might be changed.
                            if (pBootloader->m_updater != NULL)
                                delete pBootloader->m_updater;

                            pBootloader->m_updater = new blfwkdll::Updater(&pBootloader->m_config);

                            PrintLog(_T("Connected to device successfully!"));
                            // Connect opertion is sucessful.
                            cntStatus = true;
                            break;
                        }
                        catch (const std::exception &e)
                        {
                            PrintLog(_T("Error: Connect device failed(%s) at %d attempts."), CString(e.what()),
                                     retry + 1);
                            Sleep(500); // Wait 500ms.
                        }
                    }
                    if (cntStatus)
                    {
                        try
                        {
                            pBootloader->m_updater->getProperty(
                                blfwkdll::Updater::PROPERTY_TAG::kPropertyTag_FlashSecurityState, responseWords);
                            pBootloader->m_targetInfo.securityState = responseWords[1];
                            PrintLog(_T("Get device security state successfully(%s)."),
                                     responseWords[1] ? _T("SECURE") : _T("UNSECURE"));
                        }
                        catch (const std::exception &e)
                        {
                            PrintLog(_T("Error: Get device security state failed(%s)."), CString(e.what()));
                            goto UpdateError;
                        }
                    }
                    else
                    {
                        PrintLog(_T("Error: Try to connect device failed."));
                        goto UpdateError;
                    }
                }
#else
                if (pBootloader->m_updater == NULL)
                {
#ifdef _DEBUG
                    PrintLog(_T("Error: Invalid Bootloader.m_updater(NULL).\r\n"));
#else
                    PrintLog(_T("Error: Fail to communicate with device. Please reconnet the device.\r\n"));
#endif
                    break;
                }
#endif
                pBootloader->m_updater->registerCallback(pBootloader->progressCallback, &(pBootloader->m_abort));

                if (pBootloader->m_targetInfo.securityState)
                {
                    try
                    {
                        if (pBootloader->m_firmwareConfig.doErasetoUnlock)
                        {
                            PrintLog(_T("Unlock device by ERASEALL......"));
                            pBootloader->m_updater->eraseAllUnsecure();
                            PrintLog(_T("Device is unlocked!"));
                        }
                        else if (pBootloader->m_firmwareConfig.useKeytoUnlock)
                        {
                            PrintLog(_T("Unlock device by BACKDOORKEY......"));

                            pBootloader->m_updater->unlockWithKey(pBootloader->m_firmwareConfig.backdoorkey);
                            PrintLog(_T("Device is unlocked!"));
                        }
                        else
                        {
                            PrintLog(_T("Update directly without unlock device."));
                        }
                    }
                    catch (const std::exception &e)
                    {
                        PrintLog(_T("Error: Unlock device failed(%s)."), CString(e.what()));
                        goto UpdateError;
                    }
                }

                try
                {
                    PrintLog(_T("Updating image......"));
                    status = pBootloader->m_updater->flashFirmware(&pBootloader->m_firmwareConfig.imageFilePath,
                                                                   pBootloader->m_firmwareConfig.baseAddress);
                    PrintLog(_T("Update image successfully!"));
                    if (status == Bootloader::KibbleStatusCode::KBL_Status_Success)
                    {
                        pBootloader->m_updater->reset();
                        PrintLog(_T("Reset device successfully!"));
                    }
                    else if (status = Bootloader::KibbleStatusCode::KBL_Status_AbortDataPhase)
                    {
                        pBootloader->progressCallback(100, 1, 1);
                    }
                    // for the left cases, an exception will be throw out.
                }
                catch (const std::exception &e)
                {
                    PrintLog(_T("Error: Update image failed(%s)."), CString(e.what()));
                    goto UpdateError;
                }
                PrintLog(_T("Update process is completed.\r\n"));

                delete pBootloader->m_updater;
                pBootloader->m_updater = NULL;

                // Status is changed from connected to disconnected, send out the message.
                if (pBootloader->m_isConneted)
                {
                    pBootloader->m_isConneted = false;
                    ::PostMessage(*g_pMainDlg, USER_MS_CONNECTION_CHANGE, NULL, NULL);
                }
                break;

            UpdateError:
                PrintLog(_T("Update process is stopped by error.\r\n"));
                break;

            case WAIT_OBJECT_0 + 5: // Erase operation
                if (pBootloader->m_updater == NULL)
                {
#ifdef _DEBUG
                    PrintLog(_T("Error: Invalid Bootloader.m_updater(NULL).\r\n"));
#else
                    PrintLog(_T("Error: Fail to communicate with device. Please reconnet the device.\r\n"));
#endif
                    break;
                }
                try
                {
                    switch (pBootloader->m_eraseOption.option)
                    {
                        case Bootloader::EraseOption::ERASE_OPERATION::erase_region:
                            pBootloader->m_updater->eraseFlashRegion(pBootloader->m_eraseOption.startAddress,
                                                                     pBootloader->m_eraseOption.length);
                            PrintLog(_T("Erase region from 0x%X to 0x%X. Completed!"),
                                     pBootloader->m_eraseOption.startAddress,
                                     pBootloader->m_eraseOption.startAddress + pBootloader->m_eraseOption.length);
                            break;
                        case Bootloader::EraseOption::ERASE_OPERATION::erase_all:
                            pBootloader->m_updater->eraseFlashAll(pBootloader->m_eraseOption.memoryID);
                            PrintLog(_T("Erase all memory of %s. Completed!"),
                                     pBootloader->m_eraseOption.memoryID == 0 ? _T("internal flash") : _T("QuadSPI0"));
                            break;
                        case Bootloader::EraseOption::ERASE_OPERATION::erase_all_and_unsecure:
                            pBootloader->m_updater->eraseAllUnsecure();
                            PrintLog(
                                _T("Erase all memory of internal flash and unsecore the ")
                                _T("device. Completed!"));
                            pBootloader->m_updater->getProperty(
                                blfwkdll::Updater::PROPERTY_TAG::kPropertyTag_FlashSecurityState, responseWords);
                            pBootloader->m_targetInfo.securityState = responseWords[1];
                            ::PostMessage(*g_pMainDlg, USER_MS_UPDATA_STATUS, NULL, NULL);
                            break;
                        default:
                            break;
                    }
                }
                catch (const std::exception &e)
                {
                    PrintLog(_T("Error: Erase operation failed(%s).\r\n"), CString(e.what()));
                }
                break;

            case WAIT_OBJECT_0 + 6: // Program Once
                if (pBootloader->m_updater == NULL)
                {
#ifdef _DEBUG
                    PrintLog(_T("Error: Invalid Bootloader.m_updater(NULL).\r\n"));
#else
                    PrintLog(_T("Error: Fail to communicate with device. Please reconnet the device.\r\n"));
#endif
                    break;
                }
                try
                {
                    pBootloader->m_updater->programOnce(pBootloader->m_programOnceOption.index,
                                                        pBootloader->m_programOnceOption.byteCount,
                                                        pBootloader->m_programOnceOption.data);
                    PrintLog(_T("Program IFR. Completed!"));
                }
                catch (const std::exception &e)
                {
                    PrintLog(_T("Error: Program IFR failed(%s).\r\n"), CString(e.what()));
                }
                break;

            default:
                break;
        }
        pBootloader->m_isRunning = false;
        pBootloader->ResetEvents(result);
    }
    return 0;
}